Revit 2026 API
LogicalOrFilter Constructor
Overload List
Name | Description
LogicalOrFilter(IList<ElementFilter>) | Initializes a new instance of the LogicalOrFilter class
LogicalOrFilter(ElementFilter, ElementFilter) |  Constructs a new instance of the logical filter with two input filters.
Top
See Also
Reference
LogicalOrFilter Class
Autodesk.Revit.DB Namespace